InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_ОбщиеПроцедурыКЦиОргсхема/Ext/Module.bsl
Функция ОтправитьЗадачуПоКомлиниям(Объект) Экспорт
	
	Если Объект.ПостАвтора.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_АдресацияЗадачПланаДействий.Пост,
		               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок КАК Порядок
		               |ИЗ
		               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
		               |ГДЕ
		               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок";
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		МойПост = Неопределено;
		
		Если Выборка.Следующий() Тогда
			МойПост = Выборка.Пост;
		КонецЕсли;
		
		Если МойПост = Неопределено Тогда
			Сообщить("Ваш пост не обозначен в адресации комцентра!");
			Возврат ложь;
		КонецЕсли;
	Иначе
		МойПост = Объект.ПостАвтора;
	КонецЕсли;
	
	// составим массивы руководителей
	МассивРукАдресата = Новый массив;
	МассивРукАдресата.Добавить(Объект.Пост);
	ТекРук = Объект.Пост.Родитель;
	Пока не ТекРук.Пустая() Цикл
		МассивРукАдресата.Добавить(ТекРук);
		ТекРук = ТекРук.Родитель;
	КонецЦикла;
	
	МассивРукМои = Новый массив;
	МассивРукМои.Добавить(МойПост);
	ТекРук = МойПост.Родитель;
	Пока не ТекРук.Пустая() Цикл
		МассивРукМои.Добавить(ТекРук);
		ТекРук = ТекРук.Родитель;
	КонецЦикла;
	
	// найдем общего руководителя
	ОбщийРук = Неопределено;
	Для каждого терминал из МассивРукАдресата Цикл
		Если МассивРукМои.Найти(терминал)<>Неопределено Тогда
			ОбщийРук = терминал;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщийРук = Неопределено Тогда
		Сообщить("У Вас нет общего руководителя!");
		Возврат ложь;
	КонецЕсли;
	
	// обозначим путь по моей линии и добавим в маршрут
	ТекТерминал = МойПост;
	
	Пока ТекТерминал <> ОбщийРук Цикл		
		Если ПолучитьКоличествоПользователейНаПосту(ТекТерминал) = 0 Тогда // пропускаем пустые терминалы
			ТекТерминал = ТекТерминал.Родитель;
			Если ТекТерминал = ОбщийРук Тогда // если уже выше некуда
				Пока ПолучитьКоличествоПользователейНаПосту(ТекТерминал) = 0 и ТекТерминал.Родитель.ТипТерминала<>Перечисления.ТипТерминалаОргСхемы.Организация Цикл // найдем хоть кого-то с руководителем (сотрудником)
					ТекТерминал = ТекТерминал.Родитель;
					ОбщийРук = ТекТерминал;
				КонецЦикла;
				
				НовЗап = Объект.Маршрут.Добавить();
				НовЗап.Пост = ТекТерминал;		
				Прервать;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		НовЗап = Объект.Маршрут.Добавить();
		НовЗап.Пост = ТекТерминал;		
		ТекТерминал = ТекТерминал.Родитель;
	КонецЦикла;
	//
	
	// обозначим путь по линии адресата и добавим в маршрут
	МассивМаршрут = Новый Массив;
	ТекТерминал = Объект.Пост;
	Пока ТекТерминал <> ОбщийРук Цикл
		Если ПолучитьКоличествоПользователейНаПосту(ТекТерминал) = 0 Тогда // пропускаем пустые терминалы
			ТекТерминал = ТекТерминал.Родитель;
			Продолжить;
		КонецЕсли;
		
		МассивМаршрут.Добавить(ТекТерминал);
		ТекТерминал = ТекТерминал.Родитель;
	КонецЦикла;
	
	сч = МассивМаршрут.Количество()-1;
	Пока сч >= 0 Цикл
		НовЗап = Объект.Маршрут.Добавить();
		НовЗап.Пост = МассивМаршрут[сч];
		сч = сч - 1;
	КонецЦикла;
	//
	
	// если учредитель
	Если Объект.Пост = ОбщийРук ИЛИ МойПост = ОбщийРук Тогда
		Если МойПост = ОбщийРук Тогда
			НовЗап = Объект.Маршрут.Вставить(0);
			НовЗап.Пост = ОбщийРук;
			Новзап.ВсеВерно = Истина;
			Новзап.ДатаПодтверждения = ТекущаяДата();
		Иначе
			НовЗап = Объект.Маршрут.Добавить();
			НовЗап.Пост = ОбщийРук;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ПостАвтора = МойПост;                
	
	КолШагов = Объект.Маршрут.Количество();
	
	Если КолШагов>1 Тогда
		Объект.Маршрут[0].ВсеВерно = Истина;
		Объект.Маршрут[0].ДатаПодтверждения = ТекущаяДата();
		
		// сразу утвердим на всех моих постах
		сч = 1;
		ПервыйНаУтверждение = Неопределено;
		Пока сч < КолШагов Цикл
			Если ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПользовательНаПосту(ПараметрыСеанса.ТекущийПользователь, Объект.Маршрут[сч].Пост) Тогда
				Объект.Маршрут[сч].ВсеВерно = Истина;
				Объект.Маршрут[сч].ДатаПодтверждения = ТекущаяДата();
			ИначеЕсли ПервыйНаУтверждение = Неопределено тогда
				ПервыйНаУтверждение = сч;
			КонецЕсли;
			сч = сч + 1;
		КонецЦикла;
		//
		// идем дальше по утверждению
		Если ПервыйНаУтверждение = Неопределено Тогда
			Объект.Пост = Объект.Маршрут[сч-1].Пост; 
		Иначе
			Объект.Пост = Объект.Маршрут[ПервыйНаУтверждение].Пост; 
		КонецЕсли;
		
		Объект.ПоКомлиниям = Истина;
		Объект.Маршрут[КолШагов-1].Пользователь = Объект.Пользователь;
		Объект.Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Сообщить("У вас нет командных линий с указанным постом!");
		Возврат ложь;
	КонецЕсли;
	
	Возврат истина;
КонецФункции

//Арчил Тваладзе 29.05.2016   
Функция ПолучитьКоличествоПользователейНаПосту(пПост) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОргСхемаСотрудники.ФизЛицо,
		|	ИА_ДанныеФизЛиц.Пользователь
		|ПОМЕСТИТЬ ВТПостыДанныеФизлиц
		|ИЗ
		|	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|		ПО ОргСхемаСотрудники.ФизЛицо = ИА_ДанныеФизЛиц.ФизЛицо
		|ГДЕ
		|	ОргСхемаСотрудники.Ссылка = &Пост
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПостыДанныеФизлиц.ФизЛицо,
		|	ВТПостыДанныеФизлиц.Пользователь
		|ИЗ
		|	ВТПостыДанныеФизлиц КАК ВТПостыДанныеФизлиц
		|ГДЕ
		|	ВТПостыДанныеФизлиц.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ ВТПостыДанныеФизлиц.Пользователь ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПостыДанныеФизлиц.ФизЛицо,
		|	ВТПостыДанныеФизлиц.Пользователь";
		
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИА_АдресацияЗадачПланаДействий.Пользователь,
	//	|	ИА_АдресацияЗадачПланаДействий.Пост
	//	|ИЗ
	//	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	//	|ГДЕ
	//	|	ИА_АдресацияЗадачПланаДействий.Пользователь <> Значение(Справочник.Пользователи.ПустаяСсылка)
	//	|	И ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	
	Запрос.УстановитьПараметр("Пост", пПост);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции
//конец Арчил Тваладзе 16.05.2016 

Функция ПолучитьПользователяНаПосту(пост) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пост", пост);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		возврат Выборка.Пользователь;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецФункции
